hobby = "ვარჯიში"
time = 2
text = "ჩემი ჰობი არის"" "+ hobby+" " "და სხვადასხვა სპორტული აქტივობები"" "+"ყოვედგიურ ვარჯიშს დაახლოებით ვუთმობ დღეში"" "+str (time)+" ""საათს"
print(text)

#1 ვარიანტი
#შევქმენი სტრინგ ცვლადებისაგან და ინტეგერ ცვლადებისაგან კომბინაციები და დავბეჭდე ცალ-ცალკე

massge = "და ჩემი საყვარელი აქტივობა არის"
hobby = "sport"
text = " გამარჯობა მე ვარ"
name = " გიორგი"
age = 21
text1 = "წლის"
text2 = "სიმაღგლეში ვარ"
heigh = 1.83
text3 = "სანტიმეტრი"

print(text)
print(name)
print(age)
print(text1)
print(text2)
print(heigh)
print(text3)
print(massge)
print(hobby)
 
 #2 ვარიანტი
# შევქმენი სტრინგ ცვლადებისგან და ინტეჯერ ცვლადებისგან კომბინაციები და დავბეჭდე ერთად
txt = "გამარჯობა მე ვარ გიორგი"
num = 10
num1 = 11
txt1 = "წლის სიმაღლეში ვარ"
hgh = 1.83
txt2 = "სანტიმეტრი და ჩემი ჰობი არის"
sport = "სპორტი"
print(txt + str(num + num1) + txt1 + str (hgh) + txt2 + sport)





