#შექმენით my_balance_ის ცვლადი, შემდეგ გაზარდეთ ამ ცვლადის მნიშვნელობა 2_ით უბრალო ფორმით, შემდე 
# კი გაზარდეთ 3_ით ოღონდ აქ გამოიყენეთ assigment operator ამის შემდეგშეცვალეთ თქვენი სურვილისამებრ
#  ცვლადი იგივენაირად assigment operator_ით

# მათემატიკური ოპერეციის პირველი ვარიანტი

my_balance = 5  # ეს არის ცვლადის მნისშვნელობა

my_balance = my_balance + 5 # ეს კიდე სადაც გავაკეთე მიმატების ოპერაცია და ცვლადს შევუცვალე მნიშვნელოაბა +5_ით  

print(my_balance)


# მათმატიკური ოპერაციის მეორე ვარიანტი
my_balance = 5  # ეს არის ანალოგიურად ცვლადის მნიშვნელობა

my_balance += 5 # ეს კიდევ გამარტივებული მათემატიკური ოპერაცია, სადაც ცვლადი შევცვალე +5_ით. შედეგი ორივეს იგივე აქვს

print(my_balance)

# მათემატიკური  ოპერაცია my version
level = 10
level +=50
level -= 20
level /= 2
level //=1.5
level *= 3
print(level) 