#1) შექმენით mybalance-ის ცვლადი, შემდეგ გაზარდეთ ამ ცვლადის მნიშვნელობა 2-თ უბრალო ფორმით, შემდეგ ისევ გაზარდეთ მნიშვნელობა 3-ით ოღონდ გამოიყენეთ assignment operator, ამის შემდეგ თქვენი სურვილისამებრ შეცვალეთ ცვლადის მნიშვნელობა იგივე assignment operator-ის საშვალებით, საბოლოოდ დაბეჭდეთ balance. კოდი ახსენით კომენატრებით, ჩამოწერეთ ყველა საუკეტესო პრაქტიკა და მიუწერეთ განმარტებები

my_balance = 10 #მივანიჭე ცვლადს მნიშვნელობა
my_balance = my_balance + 2 # ცვლადს დავუმატე 2 ჩვეულებრივი მოქმედებით
my_balance += 3 #აქაც ასევე ცვლადს დავუმატე 3 ოღონდ assignment operator_ით
print(my_balance)
# my version 
balance = 5 # აქ მივანიჭე ცვლადს მნიშვნელობა 5
balance += 5 # და აქ დავუმატე მარტივი ოპერაციით (assignment operator)_ით 
print(my_balance) #აქ მივიღე შედეგი
#ორივე მოქმედება ერთანირი შედეგიტ მუშაობს მაგრამ მეორე ვერსია უფრო პრაქტიკულია

#2) გააკეთეთ პროგრამა რომელშიც გექნებათ ცვლდი სადაც შეინახავთ თქვენს hobby-ის, ასევე შექმენით string ტიპის ცვლადი რომელშიც შეინახვათ თქვენთვის სასურველ მესიჯს, შემდეგ ეს ორი ტექსტი დაბეჭდეთ ერთად, ასევე აიღეთ 2 integer ტიპის ცვლადი და დაბეჭდეთ მათი შეკრებაც, თქვენი სიტყვებით ახსენით რა განსხვავებაა ამ ორი სხვადასხვა ტიპის ცვლადების დამატების ოპერაციებს შორის, რა ეწოდება თითოეულ მოვლენას

# 1) string (str) ტიპის ცვლადი
hoobby = "ვარჯიში" #აქ ავიღე ცვლადის მნიშვნელობაში სტრინგ ტიპის ცვლადი
text = "მე მქვია გიორგი და ჩემი ჰობი არის" #აქც იგივენაირად სტრინგ ტიპის ცვლადი
print (text + " " +hoobby) #და აქ შევაერთე წინადადებაში
#მეორე ვარიანტი string ტიპის ცვლადის ოპერაცია
text1="მე მქვია გიორგი და ჩემი ჰობი არის"
hobby1="ვარჯიში"
print(text1 +" "+ hobby1)

# 1) integer (int) ტიპის ცვლადი
level = 150 #მივანიჭე ცვლადის მნიშვნელობას ინტეჯერ ტიპის ცვლადი
level1 = 150 #აქაც იგივენაირად
print(level + level1) #და შევკრიბე ერთმანეთი როგორც ჩვენ ვიცით ინტეჯერ ცვლადებს შეუძლიათ მათემატიკური ოპერაციების გაკეთბა

# 2)integer (int) ტიპის ცვლადი
lvl = 150 #აქ მივანიჭე ინტეჯერ ტიპის ცვლადს მნიშვნელობა
lvl +=150 #და აქ მეორე და უფრო მოსახერხებელი ოპერაციით (assignment operator)_ით
print(lvl) # და გამოვიტანე შედეგი