#2) name = "Nino"
#print(name + 3)

#აიღეთ მოცემული კოდი, გამოიყენეთ შესაბამისი converter - ი იმისათვის რომ Terminal - ში გამოიტანოთ მნიშვნელობა Nino3

#3) თქვენი სიტყვებით ახსენით, რატომ ფიქრობთ რისთვის გვჭირდება converter - ები, ასევე ახსენით მათი დანიშნულება და მოიყვანეთ მაგალითებიც

#4) კომენტარების სახით ახსენით თუ რა არის Debugging - რისთვის ვიყენებთ ჩვენ მას ასევე ახსენით არის თუ არა Debugging - ი მნიშვნელოვანი

#5) რა მონაცემთა ტიპს მიეკუთვნება True და False მნიშვნელობები

#6) ლოგიკური და შედარებითი ოპერატორების სექციების გავლის შემდეგ დაწერეთ 2-2 მაგალითი

#7) შექმენით ცვლადი მასში შეინახეთ თქვენი სახელი და გვარი, (ცვლადს დაარქვით შესაბამისი სახელი), დაპრინტეთ ცვლადი იმდენჯერ რამდენი წლისაც ხართ, ჯერ გამოიყენეთ ცუდი პრაქტიკა (გრძელი გზა) და შემდეგ მოკლე გზა

#2)
 
name = "nino"
print (name + str(3))

#3)კოვერტერები საჭირო არის იმისათვის რომ შევძლოტ იტერაციის შესრულება და ასევე მომხმარებლისთისაც ჩვენთვისაც პრაკტიკული იყოს ზუსტი მოქმედებები და პასუხები
 
#4)  Debugging არის პროგრამირებაში პრაქტიკულად მარტივი გამოსაყენებელი რადგან ის საშუალებას გვაძლევს ნაბიჯ-ნაბიჯ განვიხილოთ ჩვენს მიერ დაწერილი კოდი

#5)bool-იან ოპერატორს ანუ ლოგიკურ ოპერატორს

#6)
age = 22
age2 = 18

if age >= age2:
    print("Welcome")
else:
    print("Youa are child")


age = 18
input_age = int(input("Enter your age:"))
if input_age >= age:
    print("Welcome")
else:
    print("You are child")

#7)
name = "giorgi svanidze"
age = 22
print(name * age)
