#2) კომენტარების დახმარებით დაწერეთ ისეთი მონაცემთა ტიპები რომლებიც თქვენ იცით, შექმენით რამოდენიმე ცვლადი განსხავევბული მონაცემთა ტიპებით და დაბეჭდეთ ისინი

#3) შექმენით ერთი ცვლადი სადაც შეინახავთ თქვენთვის სასურველ რიცხვს, თქვენი დავალებაა რომ ამ რიცხვის მნიშვნელობა შეცვალოთ და შეცვლილი ცვლადი დაბეჭდოთ

#4) numberthatisstoredinavariable - კომენტარების სახით ახსენით თუ რა უნდა გამოვიყენოთ ჩვენ იმისათვის რომ ცვლადის სახელი უფრო გასაგები გახდეს

#5) name = "Nino"
#print(name + 3)

#კომენტარების სახით ახსენით თუ რატომ გამოიტანს მოცემული კოდი error - ს

#6) შექმენით ორი ცვალდი, პირველში შეინახეთ თქვენი სახელი, მეორეში შეინახეთ თქვენი გვარი, რადგანაც ორივე მნიშვნელობა არის string - ი თქვენ შეგეძლებათ ამ ცვლადის მნიშვნელობების შეერთება, დაბეჭდეთ თქვენი სახელი და გვარი ერთად


#2.

#1) +
num1 = 5
num2 = 5
print(num1 + num2)

#2) *
num3 = 5
num4 = 5
print(num3 * num4)

#3)%
Num1 = 20
Num2 =  5
print(Num1 % Num2)

#4) -
num5 = 10
num6 = 5
print(num5 - num6)

#3.
num7 = 8
num7 = 23

print(num7)

#4.
# ამისათვის საჭიროა დიდი წინადადებებთან გამოვიყენოთ ქვედა ტირე გამოტოვების მაგივრად მაგ:giorgi_svanidze

#5.
#იმიტომ რომ ამ მოქმედებაში str ანუ იგივე string ემატება int ანუ integer-ს რაც არ შეიძლება მოხდეს ამ ყველაფერს ეწოდება კონკატენაცია მაგრამ კონკატენაცია უნდა მოხდეს სწორი ფორმულირებით და სწორად რო მოხდეს ეს ყველაფერი ამისთვის საჭიროა int გადვაქციოთ str- ად

#6.
Name1 = "giorgi"
Name2 = "svanidze"

print(Name1   +  Name2)
