#2) name = "Nino"
#print(name + 3)

#აიღეთ მოცემული კოდი, გამოიყენეთ შესაბამისი converter - ი იმისათვის რომ Terminal - ში გამოიტანოთ მნიშვნელობა Nino3

#3) თქვენი სიტყვებით ახსენით, რატომ ფიქრობთ რისთვის გვჭირდება converter - ები, ასევე ახსენით მათი დანიშნულება და მოიყვანეთ მაგალითებიც

#4) კომენტარების სახით ახსენით თუ რა არის Debugging - რისთვის ვიყენებთ ჩვენ მას ასევე ახსენით არის თუ არა Debugging - ი მნიშვნელოვანი

#5) რა მონაცემთა ტიპს მიეკუთვნება True და False მნიშვნელობები

#6) ლოგიკური და შედარებითი ოპერატორების სექციების გავლის შემდეგ დაწერეთ 2-2 მაგალითი

#7) შექმენით ცვლადი მასში შეინახეთ თქვენი სახელი და გვარი, (ცვლადს დაარქვით შესაბამისი სახელი), დაპრინტეთ ცვლადი იმდენჯერ რამდენი წლისაც ხართ, ჯერ გამოიყენეთ ცუდი პრაქტიკა (გრძელი გზა) და შემდეგ მოკლე გზა

#2.

name = "nino"
print (name + "3")

#3.
# კონვერტერი არი იგივე გარდაქმნა რომელიც გათვლილია მომხმარებლისთვის და შესაძლებელია მაგალითად int გარდაიქმნას float ის სახით ანუ მთელი რიცხვი გარდაიქმანას ათწილადის სახით ან პირიქით მაგ: num = 5 - print float (num) = 5.0

#4.
# Debugging არის ვიზუალ სტუდიოში ჩაშენებული პროგრამა რომელიც გვეხმარება შეცდომების მოძებნაში და ასევე კოდს ხდის თვალსაჩინოს თუ რას ვაკეთებთ კოდის წერის დროს და გვეძლევა საშუალება ჩვენს მიერ დაწერილი კოდი განვიხილოთ დეტალურად.

#5.
# True and false მიეკუთვნება bool- იანი ტიპის მონაცემს ანუ ლოგიკური ტიპის მონაცემს.

#6.
#მაგ; number = 5>=5; number1 = 5>5; number2 = 2<5; number3 = 2<= 5.


#7.

name = "Giorgi"
surname = "Svanidze"
age = 22

print((name + " " +surname + " ") * age)
