#2) შექმენით ერთი ცვლადი სადაც შეინახავთ თქვენს სახელს, (ცვლადს დაარქვით შესაბამისი სახელი) თქვენი დავალებაა რომ მოცემული სახელი რომელიც შენახული გაქვთ ცვლადში დაბეჭდოთ

#3) შექმენით ორი ცვლადი num1, num2 შეინახეთ მათში რიცხვები დაბეჭდეთ ამ ორი რიცხვის ჯამი, სხვაობა

#4) კომენტარების სახით ახსენით თუ რას აკეთებს print ბრძანება, რა არის ცვლადი და რაში ვიყენებთ ჩვენ მას


#2)
Name = "giorgi"
print(Name)

#3)
Num1 = 10
Num2 = 15
Num3 = 5
num4 = 7
print((Num1 + Num2) / Num3 * (num4))

#4)  print არის ბრძანება რომელსაც ტერმინალში გამოაქვს საბოლოო შედეგი


