"(ტექსტურ ფაილში) თქვენი სიტყვებით ახსენით რა არის input და output, მოიყვანეთ მაგალითები და დაურთეთ სურათები"

input = "არის ერთ-ერთი ბრზანება რომელიც ნიშნავს მნიშვნელობის შეტანას და გათვლილია მომხმარებლისთვის რათ ტერმინალიდან შეძლოს მომხმარებელმა ტეხსტის მითითება ასევე არ უნდა დაგვავიწყდეს ისიც რომ ინფუთ ოპერატორი კითხულობს მხოლოდ STRING ტიპის ცვლადებს"

output = "ეს არის ბრძანება აუთფუთ ოპერატორი რაც ნიშნავს გამოტანას და მისი მნიშვნელობა არის შეტანილი ტეხსტი გამოიტანოს ტერმინალში"

მაგ: input

number1 = input ( " Enter your name :") #" აქ მომხმარებელს საშუალება მიეცემა ჩაწეროს მისი მონაცემი სახელის სახით "
number2 = input("Enter your surname :") #"აქ კიდევ საშუალება მიეცემა ჩაწეროს მისი გვარი"

print(number1+ " " + number2) #"აქ ტერმინალში  სახელი და გვარის ჩაწერის შემდეგ შეაერთებს ერთმანეთს და გამოიტანს ერთად"



