#1) კომენტარების სახით ახსენით თუ რა არის algorithm, ასევე მოიყანეთ ცხოვრებისეული მაგალითი

#2) ახსენით თუ რა არის sequencing, iteration, selection მოიყვანეთ მაგალითებიც

#3) შექმენით ერთი ცვლადი მასში შეინახეთ თქვენი ასაკი, თქვენი დავალებაა რომ შეამოწმოთ თუ ასაკი მეტია ან ტოლი 18 - ის მაშინ დაბეჭდეთ You are an adult, სხვა შემთხვევაში კი გამოიტანეთ You are a kid


# ალგორითმი არის საფუძველი იმისა რომელიც გვაძლევს საშუალებას შევქმნატ პროგრამა რომელიც გვიმარტივებს პროგრამირების ენას ცხოვრებისეულად რომ მოვიყვანოთ მაგალითი არის დღის გეგმა რომ შევადგინოთ ჩვენი დღევანდელი დღის განრიგი მაგ: დილას 7 საათზე ვარჟიში შემდეგ ლექცია შემდეგ მუშაობა ვარჯიში და ძილი 

# sequencing- არის დაწერილი კოდის თანმიმდევრობა, iteration-განმეორება, selection-არჩევა

#3)

age = 22
num = 18


if age >= num:
    print ("You are an adult")
else:
    print("You are a kid")