#1) შექმენით პროგრამა სადაც გამოიყენებთ for ციკლს რომელიც 0 დან 10ის ჩათვლით მიანიჭებს მნიშვნელობებს i ცვლადს, თქვენი დავალებაა შეამოწმოთ ყველა მნიშნელობა if გამოყენებით თუ რიცხვი ლუწია დაბეჭდეთ რომ კონკრეტული რიცხვი ლუწია სხვა შემთხვევაში დაბეჭდეთ რომ კენტია

#2) კომენტარების სახით ახსენით თუ თქვენი აზრით რა არის for loop, დაბეჭდეთ თქვენი სახელი 10 - ჯერ

#3) შექმენით ერთი ცვლადი შეინახეთ მასში თქვენი სახელი, თქვენი დავალებაა for loop - ის გამოყენებით დაბეჭდოთ ამ ცვლადში არსებული მნიშვნელობის თითოეული სიმბოლო

#4) for ციკლის გამოყენებით მომხმარებელს input ფუნქციის გამოყენებით 5 ჯერ შემოატანინეთ რაღაცა რიცხვი, შეკრიბეთ ყველა შემოტანილი რიცხვი და საბოლოოდ დაბეჭდეთ რიცხვების ჯამი ციკლის შემდეგ

#5) for loop - ის გამოყენებით მომხმარებელს შემოატანინეთ 3 რიცხვი, გამოითვალეთ ამ რიცხვების საშუალო არითემტიკული და დაბეჭდეთ საბოლოო შედეგი

#6) თქვენი დავალებაა რომ for loop - ის გამოყენებით 1, 10 - ის ჩათვლით დაბეჭდოთ მხოლოდ ლუწი რიცხვების ჯამი

for i in range(0,11):
    if i % 2 == 0:
        print(i, "its even")
    else:
        print(i,  "its odd")


#2)for loop არის იგივე კოდის გამეორება მაგ:
for i in range (10):
    print("giorgi svanidze")


#3)
for name in range (0,7):
    name = "giorgi"
    print(name)

#4)
sum = 0
for i in range (5):
    user_input = float(input("Enter yout sum:"))
    sum = sum + user_input
    print(sum)